//植物信息来源：iplant.cn
const plantDetailData = [{
    id: 1,
    title: '芒萁',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/芒萁.png',
    content:`形态特征
    生活型：	蕨类
    株：	植株高0.45-0.9(1.2)米；
    茎：	根茎长而横走，密被暗锈色长毛；
    叶：	叶疏生；叶柄长24-56厘米，棕禾秆色，基部以上无毛；叶轴一至回2叉分枝，一回羽轴长约9厘米，被暗锈色毛，后渐光滑，二回羽轴长3-5厘米；腋芽卵形，被锈黄色毛，芽苞卵形，边缘具不规则裂片或粗齿牙，稀全缘；各回分叉处托叶状羽片平展，宽披针形，生于一回分叉处的羽片长9.5-16.5厘米，宽3.5-5.2厘米，生于二回分叉处的羽片长4.4-11.5厘米，宽1.6-3.6厘米；末回羽片长16-23.5厘米，宽4-5.5厘米，披针形或宽披针形，顶端尾状，基部上侧窄，篦齿状深裂几达羽轴；裂片平展，35-50对，线状披
    孢子囊：	孢子囊羣圆形，一列，着生于基部上侧或上下两侧小脉的弯弓处，由5-8个孢子囊组成；
    果：	孢子囊群圆形，1列，着生基部上侧或上下两侧小脉弯弓处，具5-8个孢子囊；
    功用价值
经济价值：	本种习性强健，易生长，新叶美观，可用于林缘、林下或荒地绿化；
`
  },
  {
    id: 2,
    title: '霸王棕',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/霸王棕.png',
    content:`形态特征
    形态特征：	常绿乔木，高达20～30 m，径达40 cm。基部膨大，叶基宿存。叶片扇形，掌状分裂，径达3 m，浅裂至1/4～1/3，裂片间有丝状纤维；蓝绿色，被白色蜡及淡红色鳞秕，具粗壮中肋，先端浅裂二叉状，叶面具显著戟突。雌雄异株。花序圆锥状生叶间，雌花序短粗，雄花序较长，有分枝。果球形，褐色，长4～5 cm，径约3 cm。种子1，近球形。
    生态习性
国内产地：	引入我国后在华南地区栽培表现良好。
国外分布：	原产马达加斯加西部稀树草原地区。
栽培要点：	适应性较强，喜阳光充足、温暖而排水良好环境，耐干旱瘠薄，对土壤要求不严。生长迅速。
    功用价值
经济价值：	霸王榈体形庞大、壮观，叶片巨大，叶色优美，坚韧直伸，株形独特优美，十分引人注目，为著名的观赏类棕榈。适宜孤植，列植或在宽阔的区域内群植。茎干可作建筑材料，叶作盖房材料，茎髓含淀粉可制作优良西米。
植物文化：	霸王榈属 (俾斯麦榈属) 仅1种，产于马达加斯。我国引入栽培。`
  },
  {
    id: 3,
    title: '变叶木',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/变叶木.png',
    content:`形态特征
    生活型：	小乔木或灌木状；
    枝：	枝无毛；
    叶：	叶薄革质，叶形、大小、色泽因品种不同有很大变异，线形、线状披针形、披针形、椭圆形、卵形、倒卵形、匙形或提琴形，长5-30厘米，宽0.5-8厘米，先端渐尖、短尖或圆钝，基部楔形或钝圆，全缘、浅裂、深裂或细长中脉连接2枚叶片，两面无毛，绿色、黄色、黄绿相间、紫红色或紫红与黄绿相间、或绿色散生黄色斑点或斑块；叶柄长0.2-2.5厘米；
    花：	花雌雄同株异序；总状花序腋生，长8-30厘米；雄花白色，花梗纤细；雌花淡黄色，花梗较粗；
    果：	蒴果近球形，稍扁，无毛，径约9毫米；
    生态习性
国内产地：	我国南部各省区常见栽培；现广泛栽培于热带地区；
国外分布：	原产于亚洲马来半岛至大洋洲；
物候期：	花期9-10月；`
  },
  {
    id: 4,
    title: '竹子',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/竹子.png',
    content:`生活型：多年生草本植物；竹类通常为灌木状至乔木状。
    茎：茎为木质，表面光滑，多为中空，有明显的节状结构；颜色随品种和年龄变化，可呈绿色、黄色或黑色。
    叶：叶片呈披针形或线状披针形，先端渐尖，基部宽楔形；质地薄而坚韧，叶片表面光滑。
    花：花序穗状，通常生长在枝顶或节间；花朵细小，不显眼，花被片简化或退化，雄蕊通常为3枚，子房下位；大多数竹种的开花周期极长（20年-120年不等），开花后常会整片死亡。
    生态习性
    国内产地：广泛分布于我国南方热带和亚热带地区，如四川、云南、广东、广西等；北方常用于园林和庭院栽培。
    国外分布：世界范围内多见于东南亚、南美洲及非洲等热带和亚热带地区，少数竹种分布于温带地区。
    物候期：一般竹林生长旺盛期为春季和夏季；部分竹种的花期会持续数年，竹笋生长的高峰期通常在春季或秋季。`
  },
  {
    id: 5,
    title: '龙船花',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/龙船花.png',
    content:`形态特征
    生活型：	灌木，高0.8-2米，无毛；
    枝：	小枝初时深褐色，有光泽，老时呈灰色，具线条。
    叶：	叶对生，有时由于节间距离极短几成4枚轮生，披针形、长圆状披针形至长圆状倒披针形，长6-13厘米，宽3-4厘米，顶端钝或圆形，基部短尖或圆形；中脉在上面扁平成略凹入，在下面凸起，侧脉每边7-8条，纤细，明显，近叶缘处彼此连结，横脉松散，明显；叶柄极短而粗或无；托叶长5-7毫米，基部阔，合生成鞘形，顶端长渐尖，渐尖部分成锥形，比鞘长。
    花：	花序顶生，多花，具短总花梗；总花梗长5-15毫米，与分枝均呈红色，罕有被粉状柔毛，基部常有小型叶2枚承托；苞片和小苞片微小，生于花托基部的成对；花有花梗或无；萼管长1.5-2毫米，萼檐4裂，裂片极短，长0.8毫米，短尖或钝；花冠红色或红黄色，盛开时长2.5-3厘米，顶部4裂，裂片倒卵形或近圆形，扩展或外反，长5-7毫米，宽4-5毫米，顶端钝或圆形；花丝极短，花药长圆形，长约2毫米，基部2裂；花柱短伸出冠管外，柱头2，初时靠合，盛开时叉开，略下弯。
    果：	果近球形，双生，中间有1沟，成熟时红黑色；种子长、宽4-4.5毫米，上面凸，下面凹。
    生态习性
    国内产地：	产福建、广东、香港、广西。
    国外分布：	分布于越南、菲律宾、马来西亚、印度尼西亚等热带地区。
    生境：	生于山地灌丛中和疏林下，有时村落附近的山坡和旷野路旁亦有生长。
    海拔：	海拔200-800米
    物候期：	花期5-7月。
    功用价值
经济价值：	龙船花在我国南部颇普遍，现广植于热带城市作庭园观赏；它的花色鲜红而美丽，花期长。`
  },
  {
    id: 6,
    title: '鸢尾',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/鸢尾.png',
    content:`形态特征
    株：	植株基部包有老叶残留叶鞘及纤维；
    茎：	根状茎粗壮，二歧分枝，径约1厘米；
    叶：	叶基生，黄绿色，宽剑形，无明显中脉，长15-50厘米，宽1.5-3.5厘米
    花：	花茎高20-40厘米，顶部常有1-2侧枝；苞片2-3，绿色，草质，披针形，长5-7.5厘米，包1-2花；花蓝紫色，径约10厘米：花被筒细长，上端喇叭形；外花被裂片圆形或圆卵形，长5-6厘米，有紫褐色花斑，中脉有白色鸡冠状附属物，内花被裂片椭圆形，长4-4.5厘米，爪部细：雄蕊长约2.5厘米，花药鲜黄色；花柱分枝扁平，淡蓝色，长约3.5厘米，顶端裂片四方形，子房纺锤状柱形，长1.8-2厘米
    果：	蒴果长椭圆形或倒卵圆形，长5-6厘米
    种子：	种子梨形，黑褐色
    染色体：	2n=24，28，32
    生态习性
国内产地：	山西、安徽、江苏、浙江、福建、湖北、湖南、江西、广西、陕西、甘肃、四川、贵州、云南、青海、海南、西藏
国外分布：	意大利（传入）、日本（传入）、朝鲜（传入）、喜马拉雅山地区（传入）
生境：	向阳坡地、林缘及水边湿地`
  },
  {
    id: 7,
    title: '南美蟛蜞菊',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/南美蟛蜞菊.png',
    content:`形态特征
    茎：	茎横卧地面，茎长可达2m以上；
    叶：	对生，椭圆形，叶上有3裂，因而也叫三裂叶蟛蜞菊；
    花：	头状花序，多单生，外围雌花1层，舌状，顶端2-3齿裂，黄色，中央两性花，黄色，结实；
    果：	瘦果；
    生态习性
国外分布：	原产热带美洲、在我国部分地区已逸生；
物候期：	花期几乎全年；
栽培要点：	性喜高温及阳光充足的环境，耐瘠，耐热，喜湿，不耐寒，不择土壤；生长适温18℃-30℃；
功用价值
经济价值：	习性强健，叶色翠绿，花色金黄，可用于路边、花台或水岸边种植观赏，也可用于水土保持工程，作为护坡、护堤的覆盖植物；本种有一定的入侵性，引种需慎重；`
  },
  {
    id: 8,
    title: '紫荆花',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/紫荆花.png',
    content:`形态特征
生活型：	落叶乔木；
茎：	幼嫩部分常被灰色短柔毛；
枝：	枝稍呈之字曲折，无毛；
叶：	叶宽卵形或近圆形，长5-9厘米，宽度常超过长度，先端2裂达叶长的1/3，裂片宽，钝头或圆，基部浅心形或深心形，有时近截形，两面无毛或下面疏被灰色短柔毛；基出脉(9-)13；叶柄长2.5-3.5厘米，被毛或近无毛；
花：	总状花序侧生或顶生，极短缩，多少呈伞房花序式，少花，被灰色短柔毛；花序梗短粗；花大，近无梗；花萼佛焰苞状，被短柔毛，一侧开裂为宽卵形、长2-3厘米的裂片；花托长约1.2厘米；花瓣倒卵形，少有倒披针形，长4-5厘米，具瓣柄，紫红或淡红色，杂以黄绿及暗紫色的条纹，近轴一片较宽；能育雄蕊5，花丝无毛，长约4厘米；退化雄蕊1-5，丝状，较短；子房具柄，被柔毛，缝线上较密；
果：	荚果带状，扁平，长15-25厘米，宽1.5-2厘米，具长柄及喙；
种子：	种子10-15，近圆形，径约1厘米；
生态习性
物候期：	花期全年，3月最盛；`
  },
  {
    id: 9,
    title: '铁树',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/铁树.png',
    content:`形态特征
    茎：	茎干圆柱状，高达3(-8)米，径达45(-95)厘米，常在基部或下部生不定芽，有时分枝，顶端密被很厚的绒毛；干皮灰黑色，具宿存叶痕；
    叶：	叶40-100片或更多，一回羽裂，长0.7-1.4(-1.8)米，宽20-25(-28)厘米，羽片呈V形伸展；叶柄长10-20厘米，具剌6-18对；羽片直或近镰刀状，革质，长10-20厘米，宽4-7毫米，基部微扭曲，外侧下延，先端渐窄，具刺状尖头，下面疏被柔毛，边缘强烈反卷，中央微凹，中脉两面绿色，上面微隆起或近平坦，下面显著隆起，横切面呈V字形；
    雄球花：	小孢子叶球卵状圆柱形，长30-60cm，径8-15cm；小孢子叶窄楔形，长3.5-6cm，宽1.7-2.5cm，先端圆状截形，具短尖头；
    大孢子：	大孢子叶长15-24厘米，密被灰黄色绒毛，不育顶片卵形或窄卵形，长6-12厘米，宽4-7厘米，边缘深裂，裂片每侧10-17，钻状，长1-3厘米；胚珠4-6，密被淡褐色绒毛；
    种子：	种子2-5，桔红色，倒卵状或长圆状，明显压扁，长4-5厘米，疏被绒毛，中种皮光滑，两侧不具槽；
    染色体：	2n=22；
    生态习性
国内产地：	福建、台湾、广东
国外分布：	日本、黑水沟地区、美国亚拉巴马州（传入）、葡萄牙亚速尔群岛（传入）、孟加拉（传入）
物候期：	孢子叶球期5-7月，种子9-10月成熟；
栽培要点：	苏铁喜暖热湿润的环境，不耐寒冷；
功用价值
理化特性：	茎内含淀粉；种子含油和丰富的淀粉，有毒；
经济价值：	苏铁为优美的观赏树种，栽培极为普遍；种子有毒，供药用；
`
  },
  {
    id: 10,
    title: '滴水观音',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/滴水观音.png',
    content:`形态特征
生活型：	大型常绿草本；
茎：	具匍匐根茎；有直立地上茎，茎高有的不及10厘米，有的高3-5米，基部生不定芽条；
叶：	叶多数；亚革质，草绿色，箭状卵形，长50-90厘米，边缘波状，后裂片连合1/5-1/10，侧脉斜升；叶柄绿或污紫色，螺旋状排列，粗厚，长达1.5米；
花：	花序梗2-3丛生，圆柱形，长12-60厘米，绿色，有时污紫色；佛焰苞管部绿色，卵形或短椭圆形，长3-5厘米，檐部黄绿色舟状，长圆形，长10-30厘米，略下弯，先端喙状；肉穗花序芳香：雌花序白色，长2-4厘米，不育雄花序绿白色，长（2.5-)5-6厘米；能育雄花序淡黄色，长3-7厘米；附属器淡绿或乳黄色，圆锥状，长3-5.5厘米，具不规则槽纹；
果：	浆果红色，卵状，长0.8-1厘米，种子1-2；
生态习性
国内产地：	产江西、福建、台湾、湖南、广东、广西、四川、贵州、云南等地。
国外分布：	国外自孟加拉、印度东北部至马来半岛、中南半岛以及菲律宾、印度尼西亚都有。
生境：	热带和亚热带地区，海拔1700米以下，常成片生长于热带雨林林缘或河谷野芭蕉林下。
海拔：	1700m；
物候期：	花期四季，密林下常不开花；
功用价值
经济价值：	根茎供药用，对腹痛、霍乱、疝气等有良效。又可治肺结核、风湿关节炎、气管炎、流感、伤寒、风湿心藏病；外用治疗疮肿毒、蛇虫咬伤、烫火伤。调煤油外用治神经性皮炎。兽医用以治牛伤风、猪丹毒。本品有毒，须久煎并换水2-3次后方能服用。鲜草汁液皮肤接触后搔痒，误入眼内可以引起失明；茎、叶误食后喉舌发痒、肿胀、流涎、肠胃烧痛、恶心、腹泻、惊厥，严重者窒息、心脏麻痹而死。民间用醋加生姜汁少许共煮，内服或含嗽以解毒。  根茎富含淀粉，可作工业上代用品，但不能食用。`
  },
  {
    id: 11,
    title: '三角梅',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/三角梅.png',
    content:`形态特征
    生活型：	藤状灌木；
    茎：	茎粗壮，刺腋生；
    叶：	叶纸质，卵形或卵状披针形，先端尖或渐尖，基部圆或宽楔形；
    花：	花顶生枝端3个苞片内，花梗与苞片中脉贴生，每苞片生1花；苞片叶状，紫或红色，长圆形或椭圆形；花被筒长约2厘米，淡绿，疏被柔毛，有棱，5浅裂；雄蕊6-8;花柱侧生，线形；花盘环状，上部撕裂状；
    生态习性
国内产地：	我国南方栽植于庭院、公园，北方栽培于温室，是美丽的观赏植物；
国外分布：	原产巴西，南北各地引种栽培；
物候期：	花期冬春（广州、海南、昆明），北方温室栽培，3-7月开花；
    `
  },
  {
    id: 12,
    title: '华南毛蕨',
    image: 'cloud://test1-9grfsypr0a1c2939.7465-test1-9grfsypr0a1c2939-1330285442/植物图标/华南毛蕨.png',
    content:`形态特征
识别要点：	本种与齿牙毛蕨的主要区别：植株高60-80厘米；羽片15-17对，长约10厘米；但向基部变狭，平展；中部羽片长15厘米，基部较宽，达1.8厘米，披针形，长渐尖头，略向上弯弓，基部平截，对称，羽裂达1/2；裂片约20对，斜展，有倒三角形缺刻分开，茎部上侧一片较长，其余的长8-7毫米，宽2.5-3毫米，披针形，急尖头，全缘；
生活型：	蕨类
株：	植株高达70厘米；
茎：	根茎横走，连同叶柄基部被鳞片；
叶：	叶近生；叶柄长达40厘米，深禾秆色，基部有1-2柔毛；叶片长约35厘米，长尾披针形，先端羽裂，二回羽裂；羽片12-16对，无柄，顶部略上弯或斜展，中部羽片长10-11厘米，中部宽1.2-1.4厘米，披针形，羽裂达1/2或稍深；羽片20-25对，基部上侧1片长6-7毫米，其余的长4-5毫米，长圆形，全缘；叶脉明显，侧脉单一，每裂片6-8对，基部1对侧脉出自主脉基部以上，先端渐尖成钝三角形网眼，自交结点伸出外行小脉直达缺刻，第二对侧脉均伸达缺刻以上的叶缘；叶草质，干后褐绿色，上面沿叶脉有1-2伏生针状毛，脉间
孢子囊：	孢子囊群小圆形，通常仅生于基部一对侧脉的中部稍上处，在羽轴两侧各成一行，囊群盖小，圆肾形，密生短柔毛，宿存；
果：	孢子囊群生于侧脉中部以上，每裂片（1-2-)4-6对；囊群盖密生柔毛，棕色，膜质，宿存；
染色体：	2n=144；
生态习性
国内产地：	浙江南部及东南部、福建（崇安、福州）、台湾（台北、新竹、台中、南投、台南、高雄、台东、屏东）、广东（罗浮山、惠阳、怀集、信宜、鼎湖、大埔、徐闻、云浮）、海南（昌江、崖县）、湖南（宜章）、江西（井冈山、寻乌、定南）、重庆（缙云山）、广西（武鸣、大明山；
国外分布：	日本、韩国、锡金、尼泊尔、缅甸、印度南部、斯里兰卡、越南、泰国、印度尼西亚（爪哇）、菲律宾均；
特有性：	特产；
生境：	山谷密林下或溪边湿地；
海拔：	90-1900m；`
  }
]
module.exports = {
  plantDetailData
};